{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": [
    "!pip install ipython-cypher -q"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## The Graph of Thrones"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"img/got-community.jpeg\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Clean the database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "187 nodes deleted.\n",
      "684 relationship deleted.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "Match(n)-[r]-(m) delete r,n            "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **Load Data**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "CREATE CONSTRAINT ON (c:Character) ASSERT c.name IS UNIQUE"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### **Livro I**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "187 nodes created.\n",
      "1555 properties set.\n",
      "684 relationships created.\n",
      "187 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book1-edges.csv\" AS row\n",
    "MERGE (src:Character {name: row.Source})\n",
    "MERGE (tgt:Character {name: row.Target})\n",
    "MERGE (src)-[r:INTERACTS1]->(tgt)\n",
    "ON CREATE SET r.weight = toInt(row.weight), r.book=1"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### **Livro II**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "169 nodes created.\n",
      "1719 properties set.\n",
      "775 relationships created.\n",
      "169 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book2-edges.csv\" AS row\n",
    "MERGE (src:Character {name: row.Source})\n",
    "MERGE (tgt:Character {name: row.Target})\n",
    "MERGE (src)-[r:INTERACTS2]->(tgt)\n",
    "ON CREATE SET r.weight = toInt(row.weight), r.book=2"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### **Livro III**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "142 nodes created.\n",
      "2158 properties set.\n",
      "1008 relationships created.\n",
      "142 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book3-edges.csv\" AS row\n",
    "MERGE (src:Character {name: row.Source})\n",
    "MERGE (tgt:Character {name: row.Target})\n",
    "MERGE (src)-[r:INTERACTS3]->(tgt)\n",
    "ON CREATE SET r.weight = toInt(row.weight), r.book=3"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### **Livros IV e V**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "298 nodes created.\n",
      "2956 properties set.\n",
      "1329 relationships created.\n",
      "298 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book45-edges.csv\" AS row\n",
    "MERGE (src:Character {name: row.Source})\n",
    "MERGE (tgt:Character {name: row.Target})\n",
    "MERGE (src)-[r:INTERACTS45]->(tgt)\n",
    "ON CREATE SET r.weight = toInt(row.weight), r.book=45"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **DB SCHEMA**"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"img/graph-schema.png\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Quantos personagens temos?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>nr_personagens</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>796</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[796]]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "MATCH (c:Character)\n",
    "RETURN count(c) as nr_personagens"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Quantas interações existem em cada livro?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>book</th>\n",
       "        <th>interacoes</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>1</td>\n",
       "        <td>684</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>2</td>\n",
       "        <td>775</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>3</td>\n",
       "        <td>1008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>45</td>\n",
       "        <td>1329</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[1, 684], [2, 775], [3, 1008], [45, 1329]]"
      ]
     },
     "execution_count": 11,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "MATCH ()-[r]->()\n",
    "RETURN r.book as book, count(r) as interacoes\n",
    "ORDER BY book"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Número de interações da Arya-Stark ao longo dos livros"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 47,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>book</th>\n",
       "        <th>interacoes</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>1</td>\n",
       "        <td>27</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>2</td>\n",
       "        <td>37</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>3</td>\n",
       "        <td>36</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>45</td>\n",
       "        <td>24</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[1, 27], [2, 37], [3, 36], [45, 24]]"
      ]
     },
     "execution_count": 47,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "MATCH (c:Character {name:'Arya-Stark'})-[r]->()\n",
    "RETURN r.book as book, count(r) as interacoes\n",
    "ORDER BY book"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "--- "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Diâmetro da rede"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> The diameter (or geodesic) of a network is defined as the longest shortest path in the network."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"img/network-diameter.gif\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Caminho curto mais longo na rede no segundo livro."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>path</th>\n",
       "        <th>len</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;Steffon-Varner&#x27;}, {&#x27;name&#x27;: &#x27;Eldon-Estermont&#x27;}, {&#x27;name&#x27;: &#x27;Bryce-Caron&#x27;}, {&#x27;name&#x27;: &#x27;Renly-Baratheon&#x27;}, {&#x27;name&#x27;: &#x27;Tywin-Lannister&#x27;}, {&#x27;name&#x27;: &#x27;Arya-Stark&#x27;}, {&#x27;name&#x27;: &#x27;Gendry&#x27;}, {&#x27;name&#x27;: &#x27;Cutjack&#x27;}, {&#x27;name&#x27;: &#x27;Tarber&#x27;}]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;Murch&#x27;}, {&#x27;name&#x27;: &#x27;Gariss&#x27;}, {&#x27;name&#x27;: &#x27;Aggar&#x27;}, {&#x27;name&#x27;: &#x27;Ramsay-Snow&#x27;}, {&#x27;name&#x27;: &#x27;Bran-Stark&#x27;}, {&#x27;name&#x27;: &#x27;Arya-Stark&#x27;}, {&#x27;name&#x27;: &#x27;Gendry&#x27;}, {&#x27;name&#x27;: &#x27;Cutjack&#x27;}, {&#x27;name&#x27;: &#x27;Kurz&#x27;}]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;Steffon-Varner&#x27;}, {&#x27;name&#x27;: &#x27;Eldon-Estermont&#x27;}, {&#x27;name&#x27;: &#x27;Bryce-Caron&#x27;}, {&#x27;name&#x27;: &#x27;Renly-Baratheon&#x27;}, {&#x27;name&#x27;: &#x27;Tywin-Lannister&#x27;}, {&#x27;name&#x27;: &#x27;Arya-Stark&#x27;}, {&#x27;name&#x27;: &#x27;Gendry&#x27;}, {&#x27;name&#x27;: &#x27;Cutjack&#x27;}, {&#x27;name&#x27;: &#x27;Kurz&#x27;}]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;Murch&#x27;}, {&#x27;name&#x27;: &#x27;Gariss&#x27;}, {&#x27;name&#x27;: &#x27;Aggar&#x27;}, {&#x27;name&#x27;: &#x27;Ramsay-Snow&#x27;}, {&#x27;name&#x27;: &#x27;Robb-Stark&#x27;}, {&#x27;name&#x27;: &#x27;Renly-Baratheon&#x27;}, {&#x27;name&#x27;: &#x27;Bryce-Caron&#x27;}, {&#x27;name&#x27;: &#x27;Eldon-Estermont&#x27;}, {&#x27;name&#x27;: &#x27;Steffon-Varner&#x27;}]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;Murch&#x27;}, {&#x27;name&#x27;: &#x27;Gariss&#x27;}, {&#x27;name&#x27;: &#x27;Aggar&#x27;}, {&#x27;name&#x27;: &#x27;Ramsay-Snow&#x27;}, {&#x27;name&#x27;: &#x27;Bran-Stark&#x27;}, {&#x27;name&#x27;: &#x27;Arya-Stark&#x27;}, {&#x27;name&#x27;: &#x27;Gendry&#x27;}, {&#x27;name&#x27;: &#x27;Cutjack&#x27;}, {&#x27;name&#x27;: &#x27;Tarber&#x27;}]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[[{'name': 'Steffon-Varner'},\n",
       "   {'name': 'Eldon-Estermont'},\n",
       "   {'name': 'Bryce-Caron'},\n",
       "   {'name': 'Renly-Baratheon'},\n",
       "   {'name': 'Tywin-Lannister'},\n",
       "   {'name': 'Arya-Stark'},\n",
       "   {'name': 'Gendry'},\n",
       "   {'name': 'Cutjack'},\n",
       "   {'name': 'Tarber'}],\n",
       "  8],\n",
       " [[{'name': 'Murch'},\n",
       "   {'name': 'Gariss'},\n",
       "   {'name': 'Aggar'},\n",
       "   {'name': 'Ramsay-Snow'},\n",
       "   {'name': 'Bran-Stark'},\n",
       "   {'name': 'Arya-Stark'},\n",
       "   {'name': 'Gendry'},\n",
       "   {'name': 'Cutjack'},\n",
       "   {'name': 'Kurz'}],\n",
       "  8],\n",
       " [[{'name': 'Steffon-Varner'},\n",
       "   {'name': 'Eldon-Estermont'},\n",
       "   {'name': 'Bryce-Caron'},\n",
       "   {'name': 'Renly-Baratheon'},\n",
       "   {'name': 'Tywin-Lannister'},\n",
       "   {'name': 'Arya-Stark'},\n",
       "   {'name': 'Gendry'},\n",
       "   {'name': 'Cutjack'},\n",
       "   {'name': 'Kurz'}],\n",
       "  8],\n",
       " [[{'name': 'Murch'},\n",
       "   {'name': 'Gariss'},\n",
       "   {'name': 'Aggar'},\n",
       "   {'name': 'Ramsay-Snow'},\n",
       "   {'name': 'Robb-Stark'},\n",
       "   {'name': 'Renly-Baratheon'},\n",
       "   {'name': 'Bryce-Caron'},\n",
       "   {'name': 'Eldon-Estermont'},\n",
       "   {'name': 'Steffon-Varner'}],\n",
       "  8],\n",
       " [[{'name': 'Murch'},\n",
       "   {'name': 'Gariss'},\n",
       "   {'name': 'Aggar'},\n",
       "   {'name': 'Ramsay-Snow'},\n",
       "   {'name': 'Bran-Stark'},\n",
       "   {'name': 'Arya-Stark'},\n",
       "   {'name': 'Gendry'},\n",
       "   {'name': 'Cutjack'},\n",
       "   {'name': 'Tarber'}],\n",
       "  8]]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "MATCH (a:Character), (b:Character) WHERE id(a) > id(b)\n",
    "MATCH p = shortestPath((a)-[:INTERACTS2*]-(b))\n",
    "WITH length(p) AS len, p\n",
    "ORDER BY len DESC\n",
    "LIMIT 5\n",
    "RETURN nodes(p) AS path, len"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "--- "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Medidas de Centralidade"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"img/measures.png\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "--- "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Degree Centrality"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> The Degree Centrality algorithm **measures the number of incoming and outgoing relationships** from a node, and helps us find the **most popular nodes** in a graph."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The following query finds the most popular characters in the 1st book, based on the number of character interactions:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>personagem</th>\n",
       "        <th>score</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Eddard-Stark</td>\n",
       "        <td>1284.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robert-Baratheon</td>\n",
       "        <td>941.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jon-Snow</td>\n",
       "        <td>784.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tyrion-Lannister</td>\n",
       "        <td>650.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sansa-Stark</td>\n",
       "        <td>545.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bran-Stark</td>\n",
       "        <td>531.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Catelyn-Stark</td>\n",
       "        <td>520.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robb-Stark</td>\n",
       "        <td>516.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Daenerys-Targaryen</td>\n",
       "        <td>443.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Arya-Stark</td>\n",
       "        <td>430.0</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Eddard-Stark', 1284.0],\n",
       " ['Robert-Baratheon', 941.0],\n",
       " ['Jon-Snow', 784.0],\n",
       " ['Tyrion-Lannister', 650.0],\n",
       " ['Sansa-Stark', 545.0],\n",
       " ['Bran-Stark', 531.0],\n",
       " ['Catelyn-Stark', 520.0],\n",
       " ['Robb-Stark', 516.0],\n",
       " ['Daenerys-Targaryen', 443.0],\n",
       " ['Arya-Stark', 430.0]]"
      ]
     },
     "execution_count": 14,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "CALL algo.degree.stream(\"Character\", \"INTERACTS1\", {\n",
    "  direction: \"BOTH\",\n",
    "  weightProperty: \"weight\"\n",
    "})\n",
    "YIELD nodeId, score\n",
    "RETURN algo.asNode(nodeId).name AS personagem, score\n",
    "ORDER BY score DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Betweenness Centrality "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"img/betweenness-centrality.png\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Betweenness centrality **identifies nodes that are strategically positioned in the network**, meaning that information will often travel through that person.  \n",
    "Such an intermediary position gives that person **power and influence**.\n",
    "\n",
    "Betweenness centrality is a raw count of the number of short paths that go through a given node. For example, if a node is located on a bottleneck between two large communities, then it will have high betweenness."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>personagem</th>\n",
       "        <th>centrality</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Eddard-Stark</td>\n",
       "        <td>4638.534951255039</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robert-Baratheon</td>\n",
       "        <td>3682.3910357678133</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tyrion-Lannister</td>\n",
       "        <td>3272.606015526035</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jon-Snow</td>\n",
       "        <td>2952.057281565677</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Catelyn-Stark</td>\n",
       "        <td>2604.7556467555924</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Daenerys-Targaryen</td>\n",
       "        <td>1484.2780232288708</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robb-Stark</td>\n",
       "        <td>1255.6896562838226</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drogo</td>\n",
       "        <td>1115.0946392450378</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bran-Stark</td>\n",
       "        <td>960.0319135675136</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sansa-Stark</td>\n",
       "        <td>639.0769144474225</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Eddard-Stark', 4638.534951255039],\n",
       " ['Robert-Baratheon', 3682.3910357678133],\n",
       " ['Tyrion-Lannister', 3272.606015526035],\n",
       " ['Jon-Snow', 2952.057281565677],\n",
       " ['Catelyn-Stark', 2604.7556467555924],\n",
       " ['Daenerys-Targaryen', 1484.2780232288708],\n",
       " ['Robb-Stark', 1255.6896562838226],\n",
       " ['Drogo', 1115.0946392450378],\n",
       " ['Bran-Stark', 960.0319135675136],\n",
       " ['Sansa-Stark', 639.0769144474225]]"
      ]
     },
     "execution_count": 20,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "CALL algo.betweenness.stream(\"Character\", \"INTERACTS1\", {\n",
    "  direction: \"BOTH\"\n",
    "})\n",
    "YIELD nodeId, centrality\n",
    "RETURN algo.asNode(nodeId).name as personagem, centrality\n",
    "ORDER BY centrality DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>loadMillis</th>\n",
       "        <th>computeMillis</th>\n",
       "        <th>writeMillis</th>\n",
       "        <th>nodes</th>\n",
       "        <th>minCentrality</th>\n",
       "        <th>maxCentrality</th>\n",
       "        <th>sumCentrality</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>3</td>\n",
       "        <td>6</td>\n",
       "        <td>4</td>\n",
       "        <td>796</td>\n",
       "        <td>-1.0</td>\n",
       "        <td>-1.0</td>\n",
       "        <td>-1.0</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[3, 6, 4, 796, -1.0, -1.0, -1.0]]"
      ]
     },
     "execution_count": 27,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "CALL algo.betweenness(\"Character\", \"INTERACTS1\", {direction: \"BOTH\", writeProperty: \"book1BetweennessCentrality\"})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "--- "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Closeness Centrality"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Closeness centrality is a **way of detecting nodes that are able to spread information very efficiently through a graph.**  \n",
    "The closeness centrality of a node **measures its average farness (inverse distance) to all other nodes**. \n",
    "\n",
    "**Nodes with a high closeness score have the shortest distances to all other nodes.**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>personagem</th>\n",
       "        <th>centrality</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Eddard-Stark</td>\n",
       "        <td>0.5636363636363636</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robert-Baratheon</td>\n",
       "        <td>0.5454545454545454</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tyrion-Lannister</td>\n",
       "        <td>0.510989010989011</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Catelyn-Stark</td>\n",
       "        <td>0.5054347826086957</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robb-Stark</td>\n",
       "        <td>0.49732620320855614</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jon-Snow</td>\n",
       "        <td>0.493368700265252</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sansa-Stark</td>\n",
       "        <td>0.48947368421052634</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bran-Stark</td>\n",
       "        <td>0.4869109947643979</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cersei-Lannister</td>\n",
       "        <td>0.484375</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Joffrey-Baratheon</td>\n",
       "        <td>0.4806201550387597</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Eddard-Stark', 0.5636363636363636],\n",
       " ['Robert-Baratheon', 0.5454545454545454],\n",
       " ['Tyrion-Lannister', 0.510989010989011],\n",
       " ['Catelyn-Stark', 0.5054347826086957],\n",
       " ['Robb-Stark', 0.49732620320855614],\n",
       " ['Jon-Snow', 0.493368700265252],\n",
       " ['Sansa-Stark', 0.48947368421052634],\n",
       " ['Bran-Stark', 0.4869109947643979],\n",
       " ['Cersei-Lannister', 0.484375],\n",
       " ['Joffrey-Baratheon', 0.4806201550387597]]"
      ]
     },
     "execution_count": 21,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "CALL algo.closeness.stream(\"Character\", \"INTERACTS1\", {\n",
    "  direction: \"BOTH\"\n",
    "})\n",
    "YIELD nodeId, centrality\n",
    "RETURN algo.asNode(nodeId).name  as personagem, centrality\n",
    "ORDER BY centrality DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "--- "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### PageRank"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"img/pagerank.svg.png\" width=\"360px\" height=\"360px\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> PageRank captures how effectively you are taking advantage of your network contacts. \n",
    "\n",
    "In our context, PageRank centrality nicely captures narrative tension.   \n",
    "Indeed, major developments occur when two important characters interact."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>personagem</th>\n",
       "        <th>score</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tyrion-Lannister</td>\n",
       "        <td>4.369831129789961</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Varys</td>\n",
       "        <td>3.544865461588527</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tywin-Lannister</td>\n",
       "        <td>2.984199425279815</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robert-Baratheon</td>\n",
       "        <td>2.07448304103602</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sansa-Stark</td>\n",
       "        <td>1.9331457486114973</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Walder-Frey</td>\n",
       "        <td>1.8838579006650322</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robb-Stark</td>\n",
       "        <td>1.3012971131399647</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Willis-Wode</td>\n",
       "        <td>1.209997296821769</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jon-Snow</td>\n",
       "        <td>1.1871823732254736</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Vardis-Egen</td>\n",
       "        <td>1.1814906569102148</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Tyrion-Lannister', 4.369831129789961],\n",
       " ['Varys', 3.544865461588527],\n",
       " ['Tywin-Lannister', 2.984199425279815],\n",
       " ['Robert-Baratheon', 2.07448304103602],\n",
       " ['Sansa-Stark', 1.9331457486114973],\n",
       " ['Walder-Frey', 1.8838579006650322],\n",
       " ['Robb-Stark', 1.3012971131399647],\n",
       " ['Willis-Wode', 1.209997296821769],\n",
       " ['Jon-Snow', 1.1871823732254736],\n",
       " ['Vardis-Egen', 1.1814906569102148]]"
      ]
     },
     "execution_count": 26,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "CALL algo.pageRank.stream(\"Character\", \"INTERACTS1\", {iterations:20, dampingFactor:0.85})\n",
    "YIELD nodeId, score\n",
    "RETURN algo.asNode(nodeId).name  as personagem, score\n",
    "ORDER BY score DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>nodes</th>\n",
       "        <th>iterations</th>\n",
       "        <th>loadMillis</th>\n",
       "        <th>computeMillis</th>\n",
       "        <th>writeMillis</th>\n",
       "        <th>dampingFactor</th>\n",
       "        <th>write</th>\n",
       "        <th>writeProperty</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>796</td>\n",
       "        <td>20</td>\n",
       "        <td>3</td>\n",
       "        <td>23</td>\n",
       "        <td>3</td>\n",
       "        <td>0.85</td>\n",
       "        <td>True</td>\n",
       "        <td>book1PageRank</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[796, 20, 3, 23, 3, 0.85, True, 'book1PageRank']]"
      ]
     },
     "execution_count": 29,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "CALL algo.pageRank(\"Character\", \"INTERACTS1\", {direction: \"BOTH\", writeProperty:'book1PageRank'})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Community Detection"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"img/community.png\" width=\"360px\" height=\"360px\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>loadMillis</th>\n",
       "        <th>computeMillis</th>\n",
       "        <th>writeMillis</th>\n",
       "        <th>postProcessingMillis</th>\n",
       "        <th>nodes</th>\n",
       "        <th>communityCount</th>\n",
       "        <th>iterations</th>\n",
       "        <th>didConverge</th>\n",
       "        <th>p1</th>\n",
       "        <th>p5</th>\n",
       "        <th>p10</th>\n",
       "        <th>p25</th>\n",
       "        <th>p50</th>\n",
       "        <th>p75</th>\n",
       "        <th>p90</th>\n",
       "        <th>p95</th>\n",
       "        <th>p99</th>\n",
       "        <th>p100</th>\n",
       "        <th>weightProperty</th>\n",
       "        <th>write</th>\n",
       "        <th>partitionProperty</th>\n",
       "        <th>writeProperty</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>152</td>\n",
       "        <td>8</td>\n",
       "        <td>2</td>\n",
       "        <td>2</td>\n",
       "        <td>796</td>\n",
       "        <td>148</td>\n",
       "        <td>1</td>\n",
       "        <td>False</td>\n",
       "        <td>1</td>\n",
       "        <td>1</td>\n",
       "        <td>1</td>\n",
       "        <td>1</td>\n",
       "        <td>2</td>\n",
       "        <td>3</td>\n",
       "        <td>9</td>\n",
       "        <td>28</td>\n",
       "        <td>85</td>\n",
       "        <td>98</td>\n",
       "        <td>weight</td>\n",
       "        <td>True</td>\n",
       "        <td>community</td>\n",
       "        <td>community</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[152,\n",
       "  8,\n",
       "  2,\n",
       "  2,\n",
       "  796,\n",
       "  148,\n",
       "  1,\n",
       "  False,\n",
       "  1,\n",
       "  1,\n",
       "  1,\n",
       "  1,\n",
       "  2,\n",
       "  3,\n",
       "  9,\n",
       "  28,\n",
       "  85,\n",
       "  98,\n",
       "  'weight',\n",
       "  True,\n",
       "  'community',\n",
       "  'community']]"
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "CALL algo.labelPropagation(\n",
    "  'MATCH (c:Character) RETURN id(c) as id',\n",
    "  'MATCH (c:Character)-[rel]-(c2) RETURN id(c) as source, id(c2) as target, SUM(rel.weight) as weight',\n",
    "  {graph:'cypher', partitionProperty: 'community'})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Querying Communities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>community</th>\n",
       "        <th>count</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>336</td>\n",
       "        <td>98</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>340</td>\n",
       "        <td>85</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>218</td>\n",
       "        <td>72</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>232</td>\n",
       "        <td>67</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>331</td>\n",
       "        <td>38</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>269</td>\n",
       "        <td>33</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>333</td>\n",
       "        <td>30</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>328</td>\n",
       "        <td>28</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>520</td>\n",
       "        <td>18</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>242</td>\n",
       "        <td>13</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[336, 98],\n",
       " [340, 85],\n",
       " [218, 72],\n",
       " [232, 67],\n",
       " [331, 38],\n",
       " [269, 33],\n",
       " [333, 30],\n",
       " [328, 28],\n",
       " [520, 18],\n",
       " [242, 13]]"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "MATCH (c:Character)\n",
    "WHERE exists(c.community)\n",
    "RETURN c.community as community, count(c) AS count\n",
    "ORDER BY count DESC limit 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> It’d be good to know who are the influential people in each community. To do that we’ll need to calculate a PageRank score for each character across all the books:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>nodes</th>\n",
       "        <th>iterations</th>\n",
       "        <th>loadMillis</th>\n",
       "        <th>computeMillis</th>\n",
       "        <th>writeMillis</th>\n",
       "        <th>dampingFactor</th>\n",
       "        <th>write</th>\n",
       "        <th>writeProperty</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>796</td>\n",
       "        <td>20</td>\n",
       "        <td>55</td>\n",
       "        <td>10</td>\n",
       "        <td>2</td>\n",
       "        <td>0.85</td>\n",
       "        <td>True</td>\n",
       "        <td>pageRank</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[796, 20, 55, 10, 2, 0.85, True, 'pageRank']]"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "CALL algo.pageRank('MATCH (c:Character) RETURN id(c) as id', 'MATCH (c:Character)-[rel]-(c2) RETURN id(c) as source, id(c2) as target, SUM(rel.weight) as weight', {graph:'cypher', writeProperty: 'pageRank'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>cluster</th>\n",
       "        <th>count</th>\n",
       "        <th>influencers</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>336</td>\n",
       "        <td>98</td>\n",
       "        <td>[&#x27;Tyrion-Lannister&#x27;, &#x27;Jaime-Lannister&#x27;, &#x27;Cersei-Lannister&#x27;, &#x27;Joffrey-Baratheon&#x27;, &#x27;Robert-Baratheon&#x27;, &#x27;Tywin-Lannister&#x27;, &#x27;Petyr-Baelish&#x27;, &#x27;Renly-Baratheon&#x27;, &#x27;Sandor-Clegane&#x27;, &#x27;Varys&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>340</td>\n",
       "        <td>85</td>\n",
       "        <td>[&#x27;Jon-Snow&#x27;, &#x27;Samwell-Tarly&#x27;, &#x27;Mance-Rayder&#x27;, &#x27;Jeor-Mormont&#x27;, &#x27;Aemon-Targaryen-(Maester-Aemon)&#x27;, &#x27;Janos-Slynt&#x27;, &#x27;Eddison-Tollett&#x27;, &#x27;Tormund&#x27;, &#x27;Bowen-Marsh&#x27;, &#x27;Craster&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>218</td>\n",
       "        <td>72</td>\n",
       "        <td>[&#x27;Catelyn-Stark&#x27;, &#x27;Robb-Stark&#x27;, &#x27;Bran-Stark&#x27;, &#x27;Rodrik-Cassel&#x27;, &#x27;Roose-Bolton&#x27;, &#x27;Edmure-Tully&#x27;, &#x27;Luwin&#x27;, &#x27;Walder-Frey&#x27;, &#x27;Brynden-Tully&#x27;, &#x27;Rickon-Stark&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>232</td>\n",
       "        <td>67</td>\n",
       "        <td>[&#x27;Daenerys-Targaryen&#x27;, &#x27;Barristan-Selmy&#x27;, &#x27;Jorah-Mormont&#x27;, &#x27;Hizdahr-zo-Loraq&#x27;, &#x27;Quentyn-Martell&#x27;, &#x27;Drogo&#x27;, &#x27;Daario-Naharis&#x27;, &#x27;Rhaegar-Targaryen&#x27;, &#x27;Irri&#x27;, &#x27;Viserys-Targaryen&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>331</td>\n",
       "        <td>38</td>\n",
       "        <td>[&#x27;Stannis-Baratheon&#x27;, &#x27;Davos-Seaworth&#x27;, &#x27;Melisandre&#x27;, &#x27;Selyse-Florent&#x27;, &#x27;Wyman-Manderly&#x27;, &#x27;Shireen-Baratheon&#x27;, &#x27;Axell-Florent&#x27;, &#x27;Cressen&#x27;, &#x27;Godry-Farring&#x27;, &#x27;Narbert-Grandison&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>269</td>\n",
       "        <td>33</td>\n",
       "        <td>[&#x27;Brienne-of-Tarth&#x27;, &#x27;Addam-Marbrand&#x27;, &#x27;Vargo-Hoat&#x27;, &#x27;Sybell-Spicer&#x27;, &#x27;Hyle-Hunt&#x27;, &#x27;Cleos-Frey&#x27;, &#x27;Shagwell&#x27;, &#x27;Dick-Crabb&#x27;, &#x27;Meribald&#x27;, &#x27;Walton&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>333</td>\n",
       "        <td>30</td>\n",
       "        <td>[&#x27;Theon-Greyjoy&#x27;, &#x27;Asha-Greyjoy&#x27;, &#x27;Ramsay-Snow&#x27;, &#x27;Balon-Greyjoy&#x27;, &#x27;Lorren&#x27;, &#x27;Aggar&#x27;, &#x27;Sour-Alyn&#x27;, &#x27;Wex-Pyke&#x27;, &#x27;Skinner&#x27;, &#x27;Barbrey-Dustin&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>328</td>\n",
       "        <td>28</td>\n",
       "        <td>[&#x27;Arya-Stark&#x27;, &#x27;Gendry&#x27;, &#x27;Hot-Pie&#x27;, &#x27;Harwin&#x27;, &#x27;Rorge&#x27;, &#x27;Tom-of-Sevenstreams&#x27;, &#x27;Weese&#x27;, &#x27;Lommy-Greenhands&#x27;, &#x27;Jaqen-Hghar&#x27;, &#x27;Lothor-Brune&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>520</td>\n",
       "        <td>18</td>\n",
       "        <td>[&#x27;Victarion-Greyjoy&#x27;, &#x27;Euron-Greyjoy&#x27;, &#x27;Rodrik-Harlaw&#x27;, &#x27;Moqorro&#x27;, &#x27;Nute&#x27;, &#x27;Hotho-Harlaw&#x27;, &#x27;Baelor-Blacktyde&#x27;, &#x27;Dunstan-Drumm&#x27;, &#x27;Ralf-Stonehouse&#x27;, &#x27;Humfrey-Hewett&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>242</td>\n",
       "        <td>13</td>\n",
       "        <td>[&#x27;Jory-Cassel&#x27;, &#x27;Jon-Arryn&#x27;, &#x27;Brandon-Stark&#x27;, &#x27;Tomard&#x27;, &#x27;Alyn&#x27;, &#x27;Lyanna-Stark&#x27;, &#x27;Vayon-Poole&#x27;, &#x27;Desmond&#x27;, &#x27;Willam-Dustin&#x27;, &#x27;Jacks&#x27;]</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[336,\n",
       "  98,\n",
       "  ['Tyrion-Lannister',\n",
       "   'Jaime-Lannister',\n",
       "   'Cersei-Lannister',\n",
       "   'Joffrey-Baratheon',\n",
       "   'Robert-Baratheon',\n",
       "   'Tywin-Lannister',\n",
       "   'Petyr-Baelish',\n",
       "   'Renly-Baratheon',\n",
       "   'Sandor-Clegane',\n",
       "   'Varys']],\n",
       " [340,\n",
       "  85,\n",
       "  ['Jon-Snow',\n",
       "   'Samwell-Tarly',\n",
       "   'Mance-Rayder',\n",
       "   'Jeor-Mormont',\n",
       "   'Aemon-Targaryen-(Maester-Aemon)',\n",
       "   'Janos-Slynt',\n",
       "   'Eddison-Tollett',\n",
       "   'Tormund',\n",
       "   'Bowen-Marsh',\n",
       "   'Craster']],\n",
       " [218,\n",
       "  72,\n",
       "  ['Catelyn-Stark',\n",
       "   'Robb-Stark',\n",
       "   'Bran-Stark',\n",
       "   'Rodrik-Cassel',\n",
       "   'Roose-Bolton',\n",
       "   'Edmure-Tully',\n",
       "   'Luwin',\n",
       "   'Walder-Frey',\n",
       "   'Brynden-Tully',\n",
       "   'Rickon-Stark']],\n",
       " [232,\n",
       "  67,\n",
       "  ['Daenerys-Targaryen',\n",
       "   'Barristan-Selmy',\n",
       "   'Jorah-Mormont',\n",
       "   'Hizdahr-zo-Loraq',\n",
       "   'Quentyn-Martell',\n",
       "   'Drogo',\n",
       "   'Daario-Naharis',\n",
       "   'Rhaegar-Targaryen',\n",
       "   'Irri',\n",
       "   'Viserys-Targaryen']],\n",
       " [331,\n",
       "  38,\n",
       "  ['Stannis-Baratheon',\n",
       "   'Davos-Seaworth',\n",
       "   'Melisandre',\n",
       "   'Selyse-Florent',\n",
       "   'Wyman-Manderly',\n",
       "   'Shireen-Baratheon',\n",
       "   'Axell-Florent',\n",
       "   'Cressen',\n",
       "   'Godry-Farring',\n",
       "   'Narbert-Grandison']],\n",
       " [269,\n",
       "  33,\n",
       "  ['Brienne-of-Tarth',\n",
       "   'Addam-Marbrand',\n",
       "   'Vargo-Hoat',\n",
       "   'Sybell-Spicer',\n",
       "   'Hyle-Hunt',\n",
       "   'Cleos-Frey',\n",
       "   'Shagwell',\n",
       "   'Dick-Crabb',\n",
       "   'Meribald',\n",
       "   'Walton']],\n",
       " [333,\n",
       "  30,\n",
       "  ['Theon-Greyjoy',\n",
       "   'Asha-Greyjoy',\n",
       "   'Ramsay-Snow',\n",
       "   'Balon-Greyjoy',\n",
       "   'Lorren',\n",
       "   'Aggar',\n",
       "   'Sour-Alyn',\n",
       "   'Wex-Pyke',\n",
       "   'Skinner',\n",
       "   'Barbrey-Dustin']],\n",
       " [328,\n",
       "  28,\n",
       "  ['Arya-Stark',\n",
       "   'Gendry',\n",
       "   'Hot-Pie',\n",
       "   'Harwin',\n",
       "   'Rorge',\n",
       "   'Tom-of-Sevenstreams',\n",
       "   'Weese',\n",
       "   'Lommy-Greenhands',\n",
       "   'Jaqen-Hghar',\n",
       "   'Lothor-Brune']],\n",
       " [520,\n",
       "  18,\n",
       "  ['Victarion-Greyjoy',\n",
       "   'Euron-Greyjoy',\n",
       "   'Rodrik-Harlaw',\n",
       "   'Moqorro',\n",
       "   'Nute',\n",
       "   'Hotho-Harlaw',\n",
       "   'Baelor-Blacktyde',\n",
       "   'Dunstan-Drumm',\n",
       "   'Ralf-Stonehouse',\n",
       "   'Humfrey-Hewett']],\n",
       " [242,\n",
       "  13,\n",
       "  ['Jory-Cassel',\n",
       "   'Jon-Arryn',\n",
       "   'Brandon-Stark',\n",
       "   'Tomard',\n",
       "   'Alyn',\n",
       "   'Lyanna-Stark',\n",
       "   'Vayon-Poole',\n",
       "   'Desmond',\n",
       "   'Willam-Dustin',\n",
       "   'Jacks']]]"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "MATCH (c:Character)\n",
    "WHERE exists(c.community)\n",
    "WITH c ORDER BY c.pageRank DESC\n",
    "RETURN c.community as cluster, count(*) AS count, collect(c.name)[..10] as influencers\n",
    "ORDER BY count DESC limit 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Intra community PageRank"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> We can also calculate the PageRank within communities.  \n",
    "Run the following query to calculate the page rank for the 2nd largest community:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>value</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;count(*)&#x27;: 1}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'count(*)': 1}]]"
      ]
     },
     "execution_count": 37,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "MATCH (c:Character) WHERE EXISTS(c.community)\n",
    "WITH c.community AS communityId, COUNT(*) AS count\n",
    "ORDER BY count DESC\n",
    "SKIP 1 LIMIT 1\n",
    "CALL apoc.cypher.doIt(\n",
    "  \"CALL algo.pageRank(\n",
    "    'MATCH (c:Character) WHERE c.community =\" + communityId + \" RETURN id(c) as id',\n",
    "    'MATCH (c:Character)-[rel]->(c2) WHERE c.community =\" + communityId + \" AND c2.community =\" + communityId + \" RETURN id(c) as source,id(c2) as target, sum(rel.weight) as weight',\n",
    "    {graph:'cypher', writeProperty: 'communityPageRank'}) YIELD nodes RETURN count(*)\", {})\n",
    "YIELD value\n",
    "RETURN value"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>personagem</th>\n",
       "        <th>communityPageRank</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jon-Snow</td>\n",
       "        <td>1.883386923642025</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Samwell-Tarly</td>\n",
       "        <td>1.5686776117596155</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ygritte</td>\n",
       "        <td>1.4361659325170315</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Spare-Boot</td>\n",
       "        <td>0.9189390271020415</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Weeper</td>\n",
       "        <td>0.9016901271414542</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Small-Paul</td>\n",
       "        <td>0.8404659449293452</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tormund</td>\n",
       "        <td>0.8194725042838826</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Varamyr</td>\n",
       "        <td>0.6442103193062304</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Xhondo</td>\n",
       "        <td>0.5944586642742257</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Theobald</td>\n",
       "        <td>0.5944586642742257</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Jon-Snow', 1.883386923642025],\n",
       " ['Samwell-Tarly', 1.5686776117596155],\n",
       " ['Ygritte', 1.4361659325170315],\n",
       " ['Spare-Boot', 0.9189390271020415],\n",
       " ['Weeper', 0.9016901271414542],\n",
       " ['Small-Paul', 0.8404659449293452],\n",
       " ['Tormund', 0.8194725042838826],\n",
       " ['Varamyr', 0.6442103193062304],\n",
       " ['Xhondo', 0.5944586642742257],\n",
       " ['Theobald', 0.5944586642742257]]"
      ]
     },
     "execution_count": 40,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.3:7474/db/data\n",
    "MATCH (c:Character) WHERE exists(c.community)\n",
    "WITH c.community AS communityId, COUNT(*) AS count\n",
    "ORDER BY count DESC\n",
    "SKIP 1 LIMIT 1\n",
    "MATCH (c:Character) WHERE c.community = communityId\n",
    "RETURN c.name as personagem, c.communityPageRank as communityPageRank\n",
    "ORDER BY c.communityPageRank DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Referências"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "[Exploratory Data Analysis](http://guides.neo4j.com/data_science/01_eda.html)  \n",
    "[Graph Algorithms](https://guides.neo4j.com/sandbox/graph-algorithms/)  \n",
    "[A Song of Ice and Fire - Dataset](https://github.com/mathbeveridge/asoiaf/tree/master/data)  \n",
    "[The Neo4j Graph Algorithms User Guide v3.5](https://neo4j.com/docs/graph-algorithms/current/)  \n",
    "[Personalized Product Recommendations with Neo4j](http://guides.neo4j.com/sandbox/recommendations)  \n",
    "[cypher-refcard](https://neo4j.com/docs/cypher-refcard/current/?ref=browser-guide)  \n",
    "[Papers With Code](https://paperswithcode.com/area/graphs)  "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "PLAY ON NEO4J :play http://guides.neo4j.com/sandbox/legis-graph"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
