{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [],
   "source": [
    "!pip install ipython-cypher -q"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {},
   "outputs": [],
   "source": [
    "%load_ext cypher"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "## The Graph of Thrones"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"img/got.jpeg\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Clean the database"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 3,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "Match(n)-[r]-(m) delete r,n            "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### **Load Data**"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CREATE CONSTRAINT ON (c:Character) ASSERT c.name IS UNIQUE"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "187 nodes created.\n",
      "1555 properties set.\n",
      "684 relationships created.\n",
      "187 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book1-edges.csv\" AS row\n",
    "MERGE (src:Character {name: row.Source})\n",
    "MERGE (tgt:Character {name: row.Target})\n",
    "MERGE (src)-[r:INTERACTS1]->(tgt)\n",
    "ON CREATE SET r.weight = toInt(row.weight), r.book=1"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "169 nodes created.\n",
      "1719 properties set.\n",
      "775 relationships created.\n",
      "169 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book2-edges.csv\" AS row\n",
    "MERGE (src:Character {name: row.Source})\n",
    "MERGE (tgt:Character {name: row.Target})\n",
    "MERGE (src)-[r:INTERACTS2]->(tgt)\n",
    "ON CREATE SET r.weight = toInt(row.weight), r.book=2"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "142 nodes created.\n",
      "2158 properties set.\n",
      "1008 relationships created.\n",
      "142 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 9,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book3-edges.csv\" AS row\n",
    "MERGE (src:Character {name: row.Source})\n",
    "MERGE (tgt:Character {name: row.Target})\n",
    "MERGE (src)-[r:INTERACTS3]->(tgt)\n",
    "ON CREATE SET r.weight = toInt(row.weight), r.book=3"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "298 nodes created.\n",
      "2956 properties set.\n",
      "1329 relationships created.\n",
      "298 labels added.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[]"
      ]
     },
     "execution_count": 10,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "LOAD CSV WITH HEADERS FROM \"https://raw.githubusercontent.com/mathbeveridge/asoiaf/master/data/asoiaf-book45-edges.csv\" AS row\n",
    "MERGE (src:Character {name: row.Source})\n",
    "MERGE (tgt:Character {name: row.Target})\n",
    "MERGE (src)-[r:INTERACTS45]->(tgt)\n",
    "ON CREATE SET r.weight = toInt(row.weight), r.book=45"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Quantos personagens temos?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>nr_personagens</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>796</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[796]]"
      ]
     },
     "execution_count": 12,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (c:Character)\n",
    "RETURN count(c) as nr_personagens"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Quantas interações existem em cada livro?"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "4 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>book</th>\n",
       "        <th>interacoes</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>1</td>\n",
       "        <td>684</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>2</td>\n",
       "        <td>775</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>3</td>\n",
       "        <td>1008</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>45</td>\n",
       "        <td>1329</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[1, 684], [2, 775], [3, 1008], [45, 1329]]"
      ]
     },
     "execution_count": 13,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH ()-[r]->()\n",
    "RETURN r.book as book, count(r) as interacoes\n",
    "ORDER BY book"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Diametro da rede"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> The diameter (or geodesic) of a network is defined as the longest shortest path in the network."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"img/network-diameter.gif\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The following query will find the longest shortest path in the network for the second book:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>path</th>\n",
       "        <th>len</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;Steffon-Varner&#x27;}, {&#x27;name&#x27;: &#x27;Eldon-Estermont&#x27;}, {&#x27;name&#x27;: &#x27;Bryce-Caron&#x27;}, {&#x27;name&#x27;: &#x27;Stannis-Baratheon&#x27;}, {&#x27;name&#x27;: &#x27;Tywin-Lannister&#x27;}, {&#x27;name&#x27;: &#x27;Arya-Stark&#x27;}, {&#x27;name&#x27;: &#x27;Gendry&#x27;}, {&#x27;name&#x27;: &#x27;Cutjack&#x27;}, {&#x27;name&#x27;: &#x27;Tarber&#x27;}]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;Murch&#x27;}, {&#x27;name&#x27;: &#x27;Gariss&#x27;}, {&#x27;name&#x27;: &#x27;Aggar&#x27;}, {&#x27;name&#x27;: &#x27;Ramsay-Snow&#x27;}, {&#x27;name&#x27;: &#x27;Roose-Bolton&#x27;}, {&#x27;name&#x27;: &#x27;Arya-Stark&#x27;}, {&#x27;name&#x27;: &#x27;Gendry&#x27;}, {&#x27;name&#x27;: &#x27;Cutjack&#x27;}, {&#x27;name&#x27;: &#x27;Kurz&#x27;}]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;Steffon-Varner&#x27;}, {&#x27;name&#x27;: &#x27;Eldon-Estermont&#x27;}, {&#x27;name&#x27;: &#x27;Bryce-Caron&#x27;}, {&#x27;name&#x27;: &#x27;Stannis-Baratheon&#x27;}, {&#x27;name&#x27;: &#x27;Tywin-Lannister&#x27;}, {&#x27;name&#x27;: &#x27;Arya-Stark&#x27;}, {&#x27;name&#x27;: &#x27;Gendry&#x27;}, {&#x27;name&#x27;: &#x27;Cutjack&#x27;}, {&#x27;name&#x27;: &#x27;Kurz&#x27;}]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;Murch&#x27;}, {&#x27;name&#x27;: &#x27;Gariss&#x27;}, {&#x27;name&#x27;: &#x27;Aggar&#x27;}, {&#x27;name&#x27;: &#x27;Ramsay-Snow&#x27;}, {&#x27;name&#x27;: &#x27;Robb-Stark&#x27;}, {&#x27;name&#x27;: &#x27;Stannis-Baratheon&#x27;}, {&#x27;name&#x27;: &#x27;Bryce-Caron&#x27;}, {&#x27;name&#x27;: &#x27;Eldon-Estermont&#x27;}, {&#x27;name&#x27;: &#x27;Steffon-Varner&#x27;}]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>[{&#x27;name&#x27;: &#x27;Murch&#x27;}, {&#x27;name&#x27;: &#x27;Gariss&#x27;}, {&#x27;name&#x27;: &#x27;Aggar&#x27;}, {&#x27;name&#x27;: &#x27;Ramsay-Snow&#x27;}, {&#x27;name&#x27;: &#x27;Roose-Bolton&#x27;}, {&#x27;name&#x27;: &#x27;Arya-Stark&#x27;}, {&#x27;name&#x27;: &#x27;Gendry&#x27;}, {&#x27;name&#x27;: &#x27;Cutjack&#x27;}, {&#x27;name&#x27;: &#x27;Tarber&#x27;}]</td>\n",
       "        <td>8</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[[{'name': 'Steffon-Varner'},\n",
       "   {'name': 'Eldon-Estermont'},\n",
       "   {'name': 'Bryce-Caron'},\n",
       "   {'name': 'Stannis-Baratheon'},\n",
       "   {'name': 'Tywin-Lannister'},\n",
       "   {'name': 'Arya-Stark'},\n",
       "   {'name': 'Gendry'},\n",
       "   {'name': 'Cutjack'},\n",
       "   {'name': 'Tarber'}],\n",
       "  8],\n",
       " [[{'name': 'Murch'},\n",
       "   {'name': 'Gariss'},\n",
       "   {'name': 'Aggar'},\n",
       "   {'name': 'Ramsay-Snow'},\n",
       "   {'name': 'Roose-Bolton'},\n",
       "   {'name': 'Arya-Stark'},\n",
       "   {'name': 'Gendry'},\n",
       "   {'name': 'Cutjack'},\n",
       "   {'name': 'Kurz'}],\n",
       "  8],\n",
       " [[{'name': 'Steffon-Varner'},\n",
       "   {'name': 'Eldon-Estermont'},\n",
       "   {'name': 'Bryce-Caron'},\n",
       "   {'name': 'Stannis-Baratheon'},\n",
       "   {'name': 'Tywin-Lannister'},\n",
       "   {'name': 'Arya-Stark'},\n",
       "   {'name': 'Gendry'},\n",
       "   {'name': 'Cutjack'},\n",
       "   {'name': 'Kurz'}],\n",
       "  8],\n",
       " [[{'name': 'Murch'},\n",
       "   {'name': 'Gariss'},\n",
       "   {'name': 'Aggar'},\n",
       "   {'name': 'Ramsay-Snow'},\n",
       "   {'name': 'Robb-Stark'},\n",
       "   {'name': 'Stannis-Baratheon'},\n",
       "   {'name': 'Bryce-Caron'},\n",
       "   {'name': 'Eldon-Estermont'},\n",
       "   {'name': 'Steffon-Varner'}],\n",
       "  8],\n",
       " [[{'name': 'Murch'},\n",
       "   {'name': 'Gariss'},\n",
       "   {'name': 'Aggar'},\n",
       "   {'name': 'Ramsay-Snow'},\n",
       "   {'name': 'Roose-Bolton'},\n",
       "   {'name': 'Arya-Stark'},\n",
       "   {'name': 'Gendry'},\n",
       "   {'name': 'Cutjack'},\n",
       "   {'name': 'Tarber'}],\n",
       "  8]]"
      ]
     },
     "execution_count": 16,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (a:Character), (b:Character) WHERE id(a) > id(b)\n",
    "MATCH p = shortestPath((a)-[:INTERACTS2*]-(b))\n",
    "WITH length(p) AS len, p\n",
    "ORDER BY len DESC\n",
    "LIMIT 5\n",
    "RETURN nodes(p) AS path, len"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Pivotal nodes"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> A node is said to be pivotal if it lies on all shortest paths between two other nodes in the network. We can find all pivotal nodes in the network."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>a.name</th>\n",
       "        <th>b.name</th>\n",
       "        <th>PivotalNode</th>\n",
       "        <th>pathLength</th>\n",
       "        <th>pathCount</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Galbart-Glover</td>\n",
       "        <td>Dolf</td>\n",
       "        <td>Tyrion-Lannister</td>\n",
       "        <td>4</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Galbart-Glover</td>\n",
       "        <td>Dolf</td>\n",
       "        <td>Shagga</td>\n",
       "        <td>4</td>\n",
       "        <td>3</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Galbart-Glover</td>\n",
       "        <td>Donal-Noye</td>\n",
       "        <td>Jon-Snow</td>\n",
       "        <td>3</td>\n",
       "        <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Galbart-Glover</td>\n",
       "        <td>Doreah</td>\n",
       "        <td>Eddard-Stark</td>\n",
       "        <td>3</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Galbart-Glover</td>\n",
       "        <td>Doreah</td>\n",
       "        <td>Daenerys-Targaryen</td>\n",
       "        <td>3</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Galbart-Glover</td>\n",
       "        <td>Dywen</td>\n",
       "        <td>Jon-Snow</td>\n",
       "        <td>3</td>\n",
       "        <td>2</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Galbart-Glover</td>\n",
       "        <td>Fogo</td>\n",
       "        <td>Drogo</td>\n",
       "        <td>5</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Galbart-Glover</td>\n",
       "        <td>Fogo</td>\n",
       "        <td>Ogo</td>\n",
       "        <td>5</td>\n",
       "        <td>4</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Gared</td>\n",
       "        <td>Bowen-Marsh</td>\n",
       "        <td>Jeor-Mormont</td>\n",
       "        <td>2</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Gared</td>\n",
       "        <td>Bran-Stark</td>\n",
       "        <td>Jeor-Mormont</td>\n",
       "        <td>2</td>\n",
       "        <td>1</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Galbart-Glover', 'Dolf', 'Tyrion-Lannister', 4, 3],\n",
       " ['Galbart-Glover', 'Dolf', 'Shagga', 4, 3],\n",
       " ['Galbart-Glover', 'Donal-Noye', 'Jon-Snow', 3, 2],\n",
       " ['Galbart-Glover', 'Doreah', 'Eddard-Stark', 3, 1],\n",
       " ['Galbart-Glover', 'Doreah', 'Daenerys-Targaryen', 3, 1],\n",
       " ['Galbart-Glover', 'Dywen', 'Jon-Snow', 3, 2],\n",
       " ['Galbart-Glover', 'Fogo', 'Drogo', 5, 4],\n",
       " ['Galbart-Glover', 'Fogo', 'Ogo', 5, 4],\n",
       " ['Gared', 'Bowen-Marsh', 'Jeor-Mormont', 2, 1],\n",
       " ['Gared', 'Bran-Stark', 'Jeor-Mormont', 2, 1]]"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (a:Character), (b:Character) WHERE id(a) > id(b)\n",
    "MATCH p = allShortestPaths((a)-[:INTERACTS1*]-(b))\n",
    "WITH collect(p) AS paths, a, b\n",
    "UNWIND nodes(head(paths)) as c // first path\n",
    "WITH *\n",
    "WHERE NOT c IN [a,b]\n",
    "AND all(path IN tail(paths) WHERE c IN nodes(path))\n",
    "RETURN a.name, b.name, c.name AS PivotalNode, length(head(paths)) AS pathLength, length(paths) AS pathCount\n",
    "SKIP 490\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Medidas de Centralidade"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"img/measures.png\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Degree Centrality"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> The Degree Centrality algorithm **measures the number of incoming and outgoing relationships** from a node, and helps us find the **most popular nodes** in a graph."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "The following query finds the most popular characters in the 1st book, based on the number of character interactions:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 50,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>personagem</th>\n",
       "        <th>score</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Eddard-Stark</td>\n",
       "        <td>1284.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robert-Baratheon</td>\n",
       "        <td>941.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jon-Snow</td>\n",
       "        <td>784.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tyrion-Lannister</td>\n",
       "        <td>650.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sansa-Stark</td>\n",
       "        <td>545.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bran-Stark</td>\n",
       "        <td>531.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Catelyn-Stark</td>\n",
       "        <td>520.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robb-Stark</td>\n",
       "        <td>516.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Daenerys-Targaryen</td>\n",
       "        <td>443.0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Arya-Stark</td>\n",
       "        <td>430.0</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Eddard-Stark', 1284.0],\n",
       " ['Robert-Baratheon', 941.0],\n",
       " ['Jon-Snow', 784.0],\n",
       " ['Tyrion-Lannister', 650.0],\n",
       " ['Sansa-Stark', 545.0],\n",
       " ['Bran-Stark', 531.0],\n",
       " ['Catelyn-Stark', 520.0],\n",
       " ['Robb-Stark', 516.0],\n",
       " ['Daenerys-Targaryen', 443.0],\n",
       " ['Arya-Stark', 430.0]]"
      ]
     },
     "execution_count": 50,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CALL algo.degree.stream(\"Character\", \"INTERACTS1\", {\n",
    "  direction: \"BOTH\",\n",
    "  weightProperty: \"weight\"\n",
    "})\n",
    "YIELD nodeId, score\n",
    "RETURN algo.asNode(nodeId).name AS personagem, score\n",
    "ORDER BY score DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "---"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Betweenness Centrality "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"img/betweenness-centrality.png\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> Betweenness centrality **identifies nodes that are strategically positioned in the network**, meaning that information will often travel through that person.  \n",
    "Such an intermediary position gives that person **power and influence**.\n",
    "\n",
    "Betweenness centrality is a raw count of the number of short paths that go through a given node. For example, if a node is located on a bottleneck between two large communities, then it will have high betweenness."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>algo.asNode(nodeId).name</th>\n",
       "        <th>centrality</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Eddard-Stark</td>\n",
       "        <td>4638.534951255041</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robert-Baratheon</td>\n",
       "        <td>3682.3910357678137</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tyrion-Lannister</td>\n",
       "        <td>3272.6060155260366</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jon-Snow</td>\n",
       "        <td>2952.057281565675</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Catelyn-Stark</td>\n",
       "        <td>2604.755646755592</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Daenerys-Targaryen</td>\n",
       "        <td>1484.2780232288706</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robb-Stark</td>\n",
       "        <td>1255.6896562838217</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Drogo</td>\n",
       "        <td>1115.0946392450367</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bran-Stark</td>\n",
       "        <td>960.0319135675138</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sansa-Stark</td>\n",
       "        <td>639.0769144474223</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Eddard-Stark', 4638.534951255041],\n",
       " ['Robert-Baratheon', 3682.3910357678137],\n",
       " ['Tyrion-Lannister', 3272.6060155260366],\n",
       " ['Jon-Snow', 2952.057281565675],\n",
       " ['Catelyn-Stark', 2604.755646755592],\n",
       " ['Daenerys-Targaryen', 1484.2780232288706],\n",
       " ['Robb-Stark', 1255.6896562838217],\n",
       " ['Drogo', 1115.0946392450367],\n",
       " ['Bran-Stark', 960.0319135675138],\n",
       " ['Sansa-Stark', 639.0769144474223]]"
      ]
     },
     "execution_count": 22,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CALL algo.betweenness.stream(\"Character\", \"INTERACTS1\", {\n",
    "  direction: \"BOTH\"\n",
    "})\n",
    "YIELD nodeId, centrality\n",
    "RETURN algo.asNode(nodeId).name, centrality\n",
    "ORDER BY centrality DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Closeness Centrality"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Closeness centrality is a way of detecting nodes that are able to spread information very efficiently through a graph.  \n",
    "The closeness centrality of a node measures its average farness (inverse distance) to all other nodes. Nodes with a high closeness score have the shortest distances to all other nodes."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>personagem</th>\n",
       "        <th>centrality</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Eddard-Stark</td>\n",
       "        <td>0.5636363636363636</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robert-Baratheon</td>\n",
       "        <td>0.5454545454545454</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tyrion-Lannister</td>\n",
       "        <td>0.510989010989011</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Catelyn-Stark</td>\n",
       "        <td>0.5054347826086957</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robb-Stark</td>\n",
       "        <td>0.49732620320855614</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jon-Snow</td>\n",
       "        <td>0.493368700265252</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Sansa-Stark</td>\n",
       "        <td>0.48947368421052634</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Bran-Stark</td>\n",
       "        <td>0.4869109947643979</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Cersei-Lannister</td>\n",
       "        <td>0.484375</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Joffrey-Baratheon</td>\n",
       "        <td>0.4806201550387597</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Eddard-Stark', 0.5636363636363636],\n",
       " ['Robert-Baratheon', 0.5454545454545454],\n",
       " ['Tyrion-Lannister', 0.510989010989011],\n",
       " ['Catelyn-Stark', 0.5054347826086957],\n",
       " ['Robb-Stark', 0.49732620320855614],\n",
       " ['Jon-Snow', 0.493368700265252],\n",
       " ['Sansa-Stark', 0.48947368421052634],\n",
       " ['Bran-Stark', 0.4869109947643979],\n",
       " ['Cersei-Lannister', 0.484375],\n",
       " ['Joffrey-Baratheon', 0.4806201550387597]]"
      ]
     },
     "execution_count": 25,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CALL algo.closeness.stream(\"Character\", \"INTERACTS1\", {\n",
    "  direction: \"BOTH\"\n",
    "})\n",
    "YIELD nodeId, centrality\n",
    "RETURN algo.asNode(nodeId).name  as personagem, centrality\n",
    "ORDER BY centrality DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### PageRank"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "<center><img src=\"img/pagerank.svg.png\" width=\"360px\" height=\"360px\" align=\"center\"/></center>"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> PageRank captures how effectively you are taking advantage of your network contacts. In our context, PageRank centrality nicely captures narrative tension. Indeed, major developments occur when two important characters interact."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 60,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>loadMillis</th>\n",
       "        <th>computeMillis</th>\n",
       "        <th>writeMillis</th>\n",
       "        <th>nodes</th>\n",
       "        <th>minCentrality</th>\n",
       "        <th>maxCentrality</th>\n",
       "        <th>sumCentrality</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>4</td>\n",
       "        <td>8</td>\n",
       "        <td>10</td>\n",
       "        <td>796</td>\n",
       "        <td>-1.0</td>\n",
       "        <td>-1.0</td>\n",
       "        <td>-1.0</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[4, 8, 10, 796, -1.0, -1.0, -1.0]]"
      ]
     },
     "execution_count": 60,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CALL algo.betweenness(\"Character\", \"INTERACTS1\", {direction: \"BOTH\", writeProperty: \"book1BetweennessCentrality\"})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 61,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>nodes</th>\n",
       "        <th>iterations</th>\n",
       "        <th>loadMillis</th>\n",
       "        <th>computeMillis</th>\n",
       "        <th>writeMillis</th>\n",
       "        <th>dampingFactor</th>\n",
       "        <th>write</th>\n",
       "        <th>writeProperty</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>796</td>\n",
       "        <td>20</td>\n",
       "        <td>4</td>\n",
       "        <td>5</td>\n",
       "        <td>3</td>\n",
       "        <td>0.85</td>\n",
       "        <td>True</td>\n",
       "        <td>book1PageRank</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[796, 20, 4, 5, 3, 0.85, True, 'book1PageRank']]"
      ]
     },
     "execution_count": 61,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CALL algo.pageRank(\"Character\", \"INTERACTS1\", {direction: \"BOTH\", writeProperty:'book1PageRank'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 62,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "5 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c.name</th>\n",
       "        <th>c.book1PageRank</th>\n",
       "        <th>c.book1BetweennessCentrality</th>\n",
       "        <th>totalInteractions</th>\n",
       "        <th>charactersInteractedWith</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Eddard-Stark</td>\n",
       "        <td>8.216258445568382</td>\n",
       "        <td>4638.534951255041</td>\n",
       "        <td>1284.0</td>\n",
       "        <td>[&#x27;Beric-Dondarrion&#x27;, &#x27;Balon-Greyjoy&#x27;, &#x27;Daryn-Hornwood&#x27;, &#x27;Wyl-(guard)&#x27;, &#x27;Wylla&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tyrion-Lannister</td>\n",
       "        <td>5.966885147057473</td>\n",
       "        <td>3272.6060155260366</td>\n",
       "        <td>650.0</td>\n",
       "        <td>[&#x27;Timett&#x27;, &#x27;Sansa-Stark&#x27;, &#x27;Theon-Greyjoy&#x27;, &#x27;Tommen-Baratheon&#x27;, &#x27;Varys&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Catelyn-Stark</td>\n",
       "        <td>5.452866427600384</td>\n",
       "        <td>2604.755646755592</td>\n",
       "        <td>520.0</td>\n",
       "        <td>[&#x27;Colemon&#x27;, &#x27;Mychel-Redfort&#x27;, &#x27;Robert-Arryn&#x27;, &#x27;Eon-Hunter&#x27;, &#x27;Nestor-Royce&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Robert-Baratheon</td>\n",
       "        <td>5.354372273758053</td>\n",
       "        <td>3682.3910357678137</td>\n",
       "        <td>941.0</td>\n",
       "        <td>[&#x27;Lancel-Lannister&#x27;, &#x27;Meryn-Trant&#x27;, &#x27;Benjen-Stark&#x27;, &#x27;Jorah-Mormont&#x27;, &#x27;Hoster-Tully&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jon-Snow</td>\n",
       "        <td>4.851433810405431</td>\n",
       "        <td>2952.057281565675</td>\n",
       "        <td>784.0</td>\n",
       "        <td>[&#x27;Jory-Cassel&#x27;, &#x27;Rodrik-Cassel&#x27;, &#x27;Matthar&#x27;, &#x27;Chett&#x27;, &#x27;Cersei-Lannister&#x27;]</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Eddard-Stark',\n",
       "  8.216258445568382,\n",
       "  4638.534951255041,\n",
       "  1284.0,\n",
       "  ['Beric-Dondarrion',\n",
       "   'Balon-Greyjoy',\n",
       "   'Daryn-Hornwood',\n",
       "   'Wyl-(guard)',\n",
       "   'Wylla']],\n",
       " ['Tyrion-Lannister',\n",
       "  5.966885147057473,\n",
       "  3272.6060155260366,\n",
       "  650.0,\n",
       "  ['Timett', 'Sansa-Stark', 'Theon-Greyjoy', 'Tommen-Baratheon', 'Varys']],\n",
       " ['Catelyn-Stark',\n",
       "  5.452866427600384,\n",
       "  2604.755646755592,\n",
       "  520.0,\n",
       "  ['Colemon', 'Mychel-Redfort', 'Robert-Arryn', 'Eon-Hunter', 'Nestor-Royce']],\n",
       " ['Robert-Baratheon',\n",
       "  5.354372273758053,\n",
       "  3682.3910357678137,\n",
       "  941.0,\n",
       "  ['Lancel-Lannister',\n",
       "   'Meryn-Trant',\n",
       "   'Benjen-Stark',\n",
       "   'Jorah-Mormont',\n",
       "   'Hoster-Tully']],\n",
       " ['Jon-Snow',\n",
       "  4.851433810405431,\n",
       "  2952.057281565675,\n",
       "  784.0,\n",
       "  ['Jory-Cassel', 'Rodrik-Cassel', 'Matthar', 'Chett', 'Cersei-Lannister']]]"
      ]
     },
     "execution_count": 62,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (c:Character)\n",
    "WITH c, [(c)-[r:INTERACTS1]-(other) | {character: other.name, weight: r.weight}] AS interactions\n",
    "RETURN c.name, c.book1PageRank, c.book1BetweennessCentrality,\n",
    "       apoc.coll.sum([i in interactions | i.weight]) AS totalInteractions,\n",
    "       [i in apoc.coll.reverse(apoc.coll.sortMaps(interactions, 'weight'))[..5] | i.character] as charactersInteractedWith\n",
    "ORDER BY c.book1PageRank DESC\n",
    "LIMIT 5"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Community Detection"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 63,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>loadMillis</th>\n",
       "        <th>computeMillis</th>\n",
       "        <th>writeMillis</th>\n",
       "        <th>postProcessingMillis</th>\n",
       "        <th>nodes</th>\n",
       "        <th>communityCount</th>\n",
       "        <th>iterations</th>\n",
       "        <th>didConverge</th>\n",
       "        <th>p1</th>\n",
       "        <th>p5</th>\n",
       "        <th>p10</th>\n",
       "        <th>p25</th>\n",
       "        <th>p50</th>\n",
       "        <th>p75</th>\n",
       "        <th>p90</th>\n",
       "        <th>p95</th>\n",
       "        <th>p99</th>\n",
       "        <th>p100</th>\n",
       "        <th>weightProperty</th>\n",
       "        <th>write</th>\n",
       "        <th>partitionProperty</th>\n",
       "        <th>writeProperty</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>90</td>\n",
       "        <td>3</td>\n",
       "        <td>1</td>\n",
       "        <td>7</td>\n",
       "        <td>796</td>\n",
       "        <td>131</td>\n",
       "        <td>1</td>\n",
       "        <td>False</td>\n",
       "        <td>1</td>\n",
       "        <td>1</td>\n",
       "        <td>1</td>\n",
       "        <td>1</td>\n",
       "        <td>2</td>\n",
       "        <td>3</td>\n",
       "        <td>14</td>\n",
       "        <td>29</td>\n",
       "        <td>67</td>\n",
       "        <td>77</td>\n",
       "        <td>weight</td>\n",
       "        <td>True</td>\n",
       "        <td>community</td>\n",
       "        <td>community</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[90,\n",
       "  3,\n",
       "  1,\n",
       "  7,\n",
       "  796,\n",
       "  131,\n",
       "  1,\n",
       "  False,\n",
       "  1,\n",
       "  1,\n",
       "  1,\n",
       "  1,\n",
       "  2,\n",
       "  3,\n",
       "  14,\n",
       "  29,\n",
       "  67,\n",
       "  77,\n",
       "  'weight',\n",
       "  True,\n",
       "  'community',\n",
       "  'community']]"
      ]
     },
     "execution_count": 63,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CALL algo.labelPropagation(\n",
    "  'MATCH (c:Character) RETURN id(c) as id',\n",
    "  'MATCH (c:Character)-[rel]-(c2) RETURN id(c) as source, id(c2) as target, SUM(rel.weight) as weight',\n",
    "  {graph:'cypher', partitionProperty: 'community'})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Querying Communities"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 64,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c.community</th>\n",
       "        <th>count</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>62</td>\n",
       "        <td>77</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>7</td>\n",
       "        <td>67</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>65</td>\n",
       "        <td>65</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>119</td>\n",
       "        <td>62</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>114</td>\n",
       "        <td>47</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>289</td>\n",
       "        <td>45</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>182</td>\n",
       "        <td>38</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>1</td>\n",
       "        <td>29</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>238</td>\n",
       "        <td>25</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>25</td>\n",
       "        <td>22</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[62, 77],\n",
       " [7, 67],\n",
       " [65, 65],\n",
       " [119, 62],\n",
       " [114, 47],\n",
       " [289, 45],\n",
       " [182, 38],\n",
       " [1, 29],\n",
       " [238, 25],\n",
       " [25, 22]]"
      ]
     },
     "execution_count": 64,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (c:Character)\n",
    "WHERE exists(c.community)\n",
    "RETURN c.community, count(*) AS count\n",
    "ORDER BY count DESC limit 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> It’d be good to know who are the influential people in each community. To do that we’ll need to calculate a PageRank score for each character across all the books:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>nodes</th>\n",
       "        <th>iterations</th>\n",
       "        <th>loadMillis</th>\n",
       "        <th>computeMillis</th>\n",
       "        <th>writeMillis</th>\n",
       "        <th>dampingFactor</th>\n",
       "        <th>write</th>\n",
       "        <th>writeProperty</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>796</td>\n",
       "        <td>20</td>\n",
       "        <td>219</td>\n",
       "        <td>18</td>\n",
       "        <td>9</td>\n",
       "        <td>0.85</td>\n",
       "        <td>True</td>\n",
       "        <td>pageRank</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[796, 20, 219, 18, 9, 0.85, True, 'pageRank']]"
      ]
     },
     "execution_count": 68,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "CALL algo.pageRank('MATCH (c:Character) RETURN id(c) as id', 'MATCH (c:Character)-[rel]-(c2) RETURN id(c) as source, id(c2) as target, SUM(rel.weight) as weight', {graph:'cypher', writeProperty: 'pageRank'})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>cluster</th>\n",
       "        <th>count</th>\n",
       "        <th>influencers</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>62</td>\n",
       "        <td>77</td>\n",
       "        <td>[&#x27;Jon-Snow&#x27;, &#x27;Samwell-Tarly&#x27;, &#x27;Mance-Rayder&#x27;, &#x27;Jeor-Mormont&#x27;, &#x27;Aemon-Targaryen-(Maester-Aemon)&#x27;, &#x27;Janos-Slynt&#x27;, &#x27;Eddison-Tollett&#x27;, &#x27;Tormund&#x27;, &#x27;Bowen-Marsh&#x27;, &#x27;Qhorin-Halfhand&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>7</td>\n",
       "        <td>67</td>\n",
       "        <td>[&#x27;Jaime-Lannister&#x27;, &#x27;Cersei-Lannister&#x27;, &#x27;Catelyn-Stark&#x27;, &#x27;Sansa-Stark&#x27;, &#x27;Joffrey-Baratheon&#x27;, &#x27;Brienne-of-Tarth&#x27;, &#x27;Tommen-Baratheon&#x27;, &#x27;Margaery-Tyrell&#x27;, &#x27;Loras-Tyrell&#x27;, &#x27;Myrcella-Baratheon&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>65</td>\n",
       "        <td>65</td>\n",
       "        <td>[&#x27;Daenerys-Targaryen&#x27;, &#x27;Jorah-Mormont&#x27;, &#x27;Hizdahr-zo-Loraq&#x27;, &#x27;Quentyn-Martell&#x27;, &#x27;Drogo&#x27;, &#x27;Daario-Naharis&#x27;, &#x27;Rhaegar-Targaryen&#x27;, &#x27;Irri&#x27;, &#x27;Viserys-Targaryen&#x27;, &#x27;Belwas&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>119</td>\n",
       "        <td>62</td>\n",
       "        <td>[&#x27;Tyrion-Lannister&#x27;, &#x27;Tywin-Lannister&#x27;, &#x27;Varys&#x27;, &#x27;Bronn&#x27;, &#x27;Oberyn-Martell&#x27;, &#x27;Jon-Connington&#x27;, &#x27;Aegon-Targaryen-(son-of-Rhaegar)&#x27;, &#x27;Podrick-Payne&#x27;, &#x27;Shae&#x27;, &#x27;Haldon&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>114</td>\n",
       "        <td>47</td>\n",
       "        <td>[&#x27;Stannis-Baratheon&#x27;, &#x27;Davos-Seaworth&#x27;, &#x27;Renly-Baratheon&#x27;, &#x27;Melisandre&#x27;, &#x27;Selyse-Florent&#x27;, &#x27;Wyman-Manderly&#x27;, &#x27;Shireen-Baratheon&#x27;, &#x27;Axell-Florent&#x27;, &#x27;Cressen&#x27;, &#x27;Mathis-Rowan&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>289</td>\n",
       "        <td>45</td>\n",
       "        <td>[&#x27;Theon-Greyjoy&#x27;, &#x27;Asha-Greyjoy&#x27;, &#x27;Ramsay-Snow&#x27;, &#x27;Lorren&#x27;, &#x27;Jeyne-Poole&#x27;, &#x27;Hagen&#x27;, &#x27;Aggar&#x27;, &#x27;Galbart-Glover&#x27;, &#x27;Sour-Alyn&#x27;, &#x27;Skinner&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>182</td>\n",
       "        <td>38</td>\n",
       "        <td>[&#x27;Arya-Stark&#x27;, &#x27;Gendry&#x27;, &#x27;Yoren&#x27;, &#x27;Beric-Dondarrion&#x27;, &#x27;Lem&#x27;, &#x27;Hot-Pie&#x27;, &#x27;Harwin&#x27;, &#x27;Tom-of-Sevenstreams&#x27;, &#x27;Thoros-of-Myr&#x27;, &#x27;Weese&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>1</td>\n",
       "        <td>29</td>\n",
       "        <td>[&#x27;Robb-Stark&#x27;, &#x27;Bran-Stark&#x27;, &#x27;Rodrik-Cassel&#x27;, &#x27;Luwin&#x27;, &#x27;Rickon-Stark&#x27;, &#x27;Meera-Reed&#x27;, &#x27;Hodor&#x27;, &#x27;Jojen-Reed&#x27;, &#x27;Osha&#x27;, &#x27;Nan&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>238</td>\n",
       "        <td>25</td>\n",
       "        <td>[&#x27;Victarion-Greyjoy&#x27;, &#x27;Aeron-Greyjoy&#x27;, &#x27;Euron-Greyjoy&#x27;, &#x27;Balon-Greyjoy&#x27;, &#x27;Hotho-Harlaw&#x27;, &#x27;Red-Oarsman&#x27;, &#x27;Lucas-Codd&#x27;, &#x27;Baelor-Blacktyde&#x27;, &#x27;Dunstan-Drumm&#x27;, &#x27;Ralf-Stonehouse&#x27;]</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>25</td>\n",
       "        <td>22</td>\n",
       "        <td>[&#x27;Petyr-Baelish&#x27;, &#x27;Pycelle&#x27;, &#x27;Lysa-Arryn&#x27;, &#x27;Robert-Arryn&#x27;, &#x27;Jory-Cassel&#x27;, &#x27;Jon-Arryn&#x27;, &#x27;Yohn-Royce&#x27;, &#x27;Marillion&#x27;, &#x27;Brandon-Stark&#x27;, &#x27;Vayon-Poole&#x27;]</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[62,\n",
       "  77,\n",
       "  ['Jon-Snow',\n",
       "   'Samwell-Tarly',\n",
       "   'Mance-Rayder',\n",
       "   'Jeor-Mormont',\n",
       "   'Aemon-Targaryen-(Maester-Aemon)',\n",
       "   'Janos-Slynt',\n",
       "   'Eddison-Tollett',\n",
       "   'Tormund',\n",
       "   'Bowen-Marsh',\n",
       "   'Qhorin-Halfhand']],\n",
       " [7,\n",
       "  67,\n",
       "  ['Jaime-Lannister',\n",
       "   'Cersei-Lannister',\n",
       "   'Catelyn-Stark',\n",
       "   'Sansa-Stark',\n",
       "   'Joffrey-Baratheon',\n",
       "   'Brienne-of-Tarth',\n",
       "   'Tommen-Baratheon',\n",
       "   'Margaery-Tyrell',\n",
       "   'Loras-Tyrell',\n",
       "   'Myrcella-Baratheon']],\n",
       " [65,\n",
       "  65,\n",
       "  ['Daenerys-Targaryen',\n",
       "   'Jorah-Mormont',\n",
       "   'Hizdahr-zo-Loraq',\n",
       "   'Quentyn-Martell',\n",
       "   'Drogo',\n",
       "   'Daario-Naharis',\n",
       "   'Rhaegar-Targaryen',\n",
       "   'Irri',\n",
       "   'Viserys-Targaryen',\n",
       "   'Belwas']],\n",
       " [119,\n",
       "  62,\n",
       "  ['Tyrion-Lannister',\n",
       "   'Tywin-Lannister',\n",
       "   'Varys',\n",
       "   'Bronn',\n",
       "   'Oberyn-Martell',\n",
       "   'Jon-Connington',\n",
       "   'Aegon-Targaryen-(son-of-Rhaegar)',\n",
       "   'Podrick-Payne',\n",
       "   'Shae',\n",
       "   'Haldon']],\n",
       " [114,\n",
       "  47,\n",
       "  ['Stannis-Baratheon',\n",
       "   'Davos-Seaworth',\n",
       "   'Renly-Baratheon',\n",
       "   'Melisandre',\n",
       "   'Selyse-Florent',\n",
       "   'Wyman-Manderly',\n",
       "   'Shireen-Baratheon',\n",
       "   'Axell-Florent',\n",
       "   'Cressen',\n",
       "   'Mathis-Rowan']],\n",
       " [289,\n",
       "  45,\n",
       "  ['Theon-Greyjoy',\n",
       "   'Asha-Greyjoy',\n",
       "   'Ramsay-Snow',\n",
       "   'Lorren',\n",
       "   'Jeyne-Poole',\n",
       "   'Hagen',\n",
       "   'Aggar',\n",
       "   'Galbart-Glover',\n",
       "   'Sour-Alyn',\n",
       "   'Skinner']],\n",
       " [182,\n",
       "  38,\n",
       "  ['Arya-Stark',\n",
       "   'Gendry',\n",
       "   'Yoren',\n",
       "   'Beric-Dondarrion',\n",
       "   'Lem',\n",
       "   'Hot-Pie',\n",
       "   'Harwin',\n",
       "   'Tom-of-Sevenstreams',\n",
       "   'Thoros-of-Myr',\n",
       "   'Weese']],\n",
       " [1,\n",
       "  29,\n",
       "  ['Robb-Stark',\n",
       "   'Bran-Stark',\n",
       "   'Rodrik-Cassel',\n",
       "   'Luwin',\n",
       "   'Rickon-Stark',\n",
       "   'Meera-Reed',\n",
       "   'Hodor',\n",
       "   'Jojen-Reed',\n",
       "   'Osha',\n",
       "   'Nan']],\n",
       " [238,\n",
       "  25,\n",
       "  ['Victarion-Greyjoy',\n",
       "   'Aeron-Greyjoy',\n",
       "   'Euron-Greyjoy',\n",
       "   'Balon-Greyjoy',\n",
       "   'Hotho-Harlaw',\n",
       "   'Red-Oarsman',\n",
       "   'Lucas-Codd',\n",
       "   'Baelor-Blacktyde',\n",
       "   'Dunstan-Drumm',\n",
       "   'Ralf-Stonehouse']],\n",
       " [25,\n",
       "  22,\n",
       "  ['Petyr-Baelish',\n",
       "   'Pycelle',\n",
       "   'Lysa-Arryn',\n",
       "   'Robert-Arryn',\n",
       "   'Jory-Cassel',\n",
       "   'Jon-Arryn',\n",
       "   'Yohn-Royce',\n",
       "   'Marillion',\n",
       "   'Brandon-Stark',\n",
       "   'Vayon-Poole']]]"
      ]
     },
     "execution_count": 67,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (c:Character)\n",
    "WHERE exists(c.community)\n",
    "WITH c ORDER BY c.pageRank DESC\n",
    "RETURN c.community as cluster, count(*) AS count, collect(c.name)[..10] as influencers\n",
    "ORDER BY count DESC limit 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Intra community PageRank"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "> We can also calculate the PageRank within communities.\n",
    "Run the following query to calculate the page rank for the 2nd largest community:"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "1 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>value</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>{&#x27;count(*)&#x27;: 1}</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[[{'count(*)': 1}]]"
      ]
     },
     "execution_count": 44,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (c:Character) WHERE EXISTS(c.community)\n",
    "WITH c.community AS communityId, COUNT(*) AS count\n",
    "ORDER BY count DESC\n",
    "SKIP 1 LIMIT 1\n",
    "CALL apoc.cypher.doIt(\n",
    "  \"CALL algo.pageRank(\n",
    "    'MATCH (c:Character) WHERE c.community =\" + communityId + \" RETURN id(c) as id',\n",
    "    'MATCH (c:Character)-[rel]->(c2) WHERE c.community =\" + communityId + \" AND c2.community =\" + communityId + \" RETURN id(c) as source,id(c2) as target, sum(rel.weight) as weight',\n",
    "    {graph:'cypher', writeProperty: 'communityPageRank'}) YIELD nodes RETURN count(*)\", {})\n",
    "YIELD value\n",
    "RETURN value"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 45,
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "10 rows affected.\n"
     ]
    },
    {
     "data": {
      "text/html": [
       "<table>\n",
       "    <tr>\n",
       "        <th>c.name</th>\n",
       "        <th>c.communityPageRank</th>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Jon-Snow</td>\n",
       "        <td>2.2560885736795018</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Ygritte</td>\n",
       "        <td>1.6987942064295838</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Samwell-Tarly</td>\n",
       "        <td>1.4899245301607456</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Tormund</td>\n",
       "        <td>1.203153118578281</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Spare-Boot</td>\n",
       "        <td>1.1767029713863306</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Small-Paul</td>\n",
       "        <td>0.8839200183293655</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Weeper</td>\n",
       "        <td>0.8328483511290595</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Pypar</td>\n",
       "        <td>0.8043644331609571</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Theobald</td>\n",
       "        <td>0.7832179276515601</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "        <td>Satin</td>\n",
       "        <td>0.7807708142214981</td>\n",
       "    </tr>\n",
       "</table>"
      ],
      "text/plain": [
       "[['Jon-Snow', 2.2560885736795018],\n",
       " ['Ygritte', 1.6987942064295838],\n",
       " ['Samwell-Tarly', 1.4899245301607456],\n",
       " ['Tormund', 1.203153118578281],\n",
       " ['Spare-Boot', 1.1767029713863306],\n",
       " ['Small-Paul', 0.8839200183293655],\n",
       " ['Weeper', 0.8328483511290595],\n",
       " ['Pypar', 0.8043644331609571],\n",
       " ['Theobald', 0.7832179276515601],\n",
       " ['Satin', 0.7807708142214981]]"
      ]
     },
     "execution_count": 45,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "%%cypher http://neo4j:dextra2020@172.19.0.2:7474/db/data\n",
    "MATCH (c:Character) WHERE exists(c.community)\n",
    "WITH c.community AS communityId, COUNT(*) AS count\n",
    "ORDER BY count DESC\n",
    "SKIP 1 LIMIT 1\n",
    "MATCH (c:Character) WHERE c.community = communityId\n",
    "RETURN c.name, c.communityPageRank\n",
    "ORDER BY c.communityPageRank DESC\n",
    "LIMIT 10"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Referências"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "http://guides.neo4j.com/data_science/01_eda.html"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "https://guides.neo4j.com/sandbox/graph-algorithms/"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "https://github.com/mathbeveridge/asoiaf/tree/master/data"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "ON NEO4J :play http://guides.neo4j.com/sandbox/legis-graph"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 4
}
